src/cf/src/Catalogs/СписокИнформационныхБаз1С/СписокИнформационныхБаз1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокИнформационныхБаз1С</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасположенияИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуБазы_v8i</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеПараметрыЗапуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверSQL</name>
    <type>
      <types>CatalogRef.СерверыSQL</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыНаСервереSQL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаДляВыгрузок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Выражение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВФормате_v8i</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВебСервисДляОбновленияСпискаБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияПараметровБазы</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ИнформационнойБазы</name>
    <comment>Должен быть уникальным в рамках одной сети</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПравДоступа</name>
    <attributes>
      <name>ОбъектДоступа</name>
      <type>
        <types>CatalogRef.ГруппыПользователейAD</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.ИменаПользователей</types>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СписокИнформационныхБаз1С/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		
		ПутьКФайлуБазы_v8i = "";
		Используется = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Если ЕстьИзмененияПараметровСпискаБазы() Тогда
		ДатаИзмененияПараметровБазы = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьИзмененияПараметровСпискаБазы()
	
	ЕстьИзменения = Ложь;
	
	// Сравнение по реквизитам справочника.
	МассивРеквизитовСравнения = Новый Массив;
	МассивРеквизитовСравнения.Добавить("Родитель");
	МассивРеквизитовСравнения.Добавить("ТипРасположенияИБ");
	МассивРеквизитовСравнения.Добавить("Сервер1С");
	МассивРеквизитовСравнения.Добавить("КаталогИБ");
	МассивРеквизитовСравнения.Добавить("ИмяБазыНаСервере");
	МассивРеквизитовСравнения.Добавить("ВерсияПлатформы");
	МассивРеквизитовСравнения.Добавить("ПутьКФайлуБазы_v8i");
	МассивРеквизитовСравнения.Добавить("ПутьКФайлуБазы_v8i");
	МассивРеквизитовСравнения.Добавить("РежимЗапуска");
	МассивРеквизитовСравнения.Добавить("ОписаниеВФормате_v8i");
	
	ЕстьИзменения = ОбщегоНазначенияКупоросСервер.ЕстьИзмененияРеквизитовОбъекта(ЭтотОбъект, Ссылка, МассивРеквизитовСравнения, ЕстьИзменения);
	
	// Сравнение таблицы параметров доступа.
	МассивТабличныхЧастейСравнения = Новый Массив;
	МассивТабличныхЧастейСравнения.Добавить("СписокПравДоступа");
	
	ЕстьИзменения = ОбщегоНазначенияКупоросСервер.ЕстьИзмененияТабличныхЧастейОбъект(ЭтотОбъект, Ссылка, МассивТабличныхЧастейСравнения, ЕстьИзменения);
	
	Возврат ЕстьИзменения;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
